Rlesjak/am263_tractionDemo/trinv.syscfg
epwm4.$name                                                      = "CONFIG_EPWM2";
epwm4.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm4.epwmTimebase_period                                        = 10000;
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm4.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM0";
epwm4.epwmCounterCompare_cmpA                                    = 5000;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.epwmDeadband_enableRED                                     = true;
epwm4.epwmDeadband_enableFED                                     = true;
epwm4.epwmDeadband_delayRED                                      = 200;
epwm4.epwmDeadband_delayFED                                      = 200;
epwm4.epwmTimebase_periodLoadEvent                               = "EPWM_SHADOW_LOAD_MODE_SYNC";
epwm4.epwmTimebase_phaseEnable                                   = true;

eqep1.selectSourceA        = "EQEP_SOURCE_DEVICE_PIN";
eqep1.selectSourceB        = "EQEP_SOURCE_DEVICE_PIN";
eqep1.selectSourceIndex    = "EQEP_SOURCE_DEVICE_PIN";
eqep1.emulationMode        = "EQEP_EMULATIONMODE_RUNFREE";
eqep1.positionCounterMax   = 4294967295;
eqep1.latchPositionCounter = "EQEP_LATCH_UNIT_TIME_OUT";
eqep1.swPositionInit       = true;
eqep1.enableModule         = true;
eqep1.eqepResolution       = "EQEP_CONFIG_1X_RESOLUTION";
eqep1.$name                = "CONFIG_EQEP2";
eqep1.captureConfig        = true;
eqep1.enableCapture        = true;
eqep1.enableUnitTimer      = true;
eqep1.capPrescale          = "EQEP_CAPTURE_CLK_DIV_64";
eqep1.evntPrescale         = "EQEP_UNIT_POS_EVNT_DIV_32";
eqep1.unitTimerPeriod      = 2000000;
eqep1.EQEP.$assign         = "EQEP2";
eqep1.EQEP.A.$assign       = "I2C0_SDA";
eqep1.EQEP.B.$assign       = "I2C0_SCL";
eqep1.EQEP.STROBE.$assign  = "MCAN2_TX";

gpio1.pinDir               = "OUTPUT";
gpio1.$name                = "CONFIG_GPIO_RES_INH";
gpio1.GPIO.gpioPin.$assign = "SDFM0_D3";

gpio2.$name                = "CONFIG_GPIO_RES_OTSD";
gpio2.GPIO.gpioPin.$assign = "SDFM0_CLK3";

gpio3.$name                = "CONFIG_GPIO_nFLT1_H";
gpio3.GPIO.gpioPin.qualSel = "async";
gpio3.GPIO.gpioPin.$assign = "MMC_DAT2";

gpio4.$name                = "CONFIG_GPIO_nFLT1_L";
gpio4.GPIO.gpioPin.qualSel = "async";
gpio4.GPIO.gpioPin.$assign = "MMC_CLK";

gpio5.$name                = "CONFIG_GPIO_nFLT2_H";
gpio5.GPIO.gpioPin.qualSel = "async";
gpio5.GPIO.gpioPin.$assign = "MMC_DAT0";

gpio6.$name                = "CONFIG_GPIO_nFLT2_L";
gpio6.GPIO.gpioPin.qualSel = "async";
gpio6.GPIO.gpioPin.$assign = "UART1_RXD";

gpio7.$name                = "CONFIG_GPIO_ASC_EN";
gpio7.pinDir               = "OUTPUT";
gpio7.GPIO.gpioPin.$assign = "EPWM13_A";

gpio8.$name                = "CONFIG_GPIO_ASC_H";
gpio8.pinDir               = "OUTPUT";
gpio8.GPIO.gpioPin.$assign = "EPWM15_A";

gpio9.$name                = "CONFIG_GPIO_ASC_L";
gpio9.pinDir               = "OUTPUT";
gpio9.GPIO.gpioPin.$assign = "EPWM14_A";

gpio10.$name                = "CONFIG_GPIO_VinvC";
gpio10.GPIO.gpioPin.$assign = "SDFM0_D1";

gpio11.$name                = "CONFIG_GPIO_OVP";
gpio11.GPIO.gpioPin.$assign = "PR0_PRU1_GPIO6";

gpio12.$name                = "CONFIG_GPIO_OCP_LATCH";
gpio12.GPIO.gpioPin.$assign = "PR0_PRU1_GPIO11";

gpio13.$name                = "CONFIG_GPIO_OTP_LATCH";
gpio13.GPIO.gpioPin.$assign = "PR0_PRU1_GPIO2";

gpio14.pinDir               = "OUTPUT";
gpio14.$name                = "CONFIG_GPIO_TEST_TOGGLE";
gpio14.GPIO.$assign         = "GPIO0";
gpio14.GPIO.gpioPin.$assign = "MMC_SDWP";

ipc.r5fss1_0     = "NONE";
ipc.r5fss1_1     = "NONE";
ipc.vringNumBuf  = 2;
ipc.vringMsgSize = 512;

mcspi1.$name                       = "CONFIG_MCSPI_UCC";
mcspi1.intrEnable                  = "POLLED";
mcspi1.SPI.$assign                 = "SPI1";
mcspi1.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].frameFormat = "POL0_PHA1";
mcspi1.mcspiChannel[0].bitRate     = 4000000;

edma1.$name                                      = "CONFIG_EDMA0";
mcspi1.edmaDriver                                = edma1;
edma1.edmaRmDmaCh[0].$name                       = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name                      = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name                         = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name                       = "CONFIG_EDMA_RM3";
edma1.edmaChannel.create(1);
edma1.edmaChannel[0].$name                       = "CONFIG_EDMA_CH0";
edma1.edmaChannel[0].channelTrigger              = "EPWM7_SOCA";
edma1.edmaChannel[0].xbarConfig.$name            = "CONFIG_DMA_TRIG_XBAR0";
edma1.edmaChannel[0].xbarConfig.xbarConfig.$name = "CONFIG_DMA_XBAR0";

uart1.$name = "CONFIG_UART_CONSOLE";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x50D00000;
mpu_armv75.size         = 14;
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Device";

mpu_armv76.$name        = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr     = 0x72000000;
mpu_armv76.size         = 14;
mpu_armv76.allowExecute = false;
mpu_armv76.attributes   = "Device";

