Rlesjak/am263_tractionDemo/trinv.syscfg
mpu_armv77.$name        = "CONFIG_MPU_REGION6";
mpu_armv77.baseAddr     = 0x701D0000;
mpu_armv77.size         = 15;
mpu_armv77.allowExecute = false;
mpu_armv77.attributes   = "Device";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC4_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc2.ADC.AIN2.$suggestSolution              = "ADC1_AIN2";
adc3.ADC.AIN0.$suggestSolution              = "ADC2_AIN0";
adc3.ADC.AIN2.$suggestSolution              = "ADC2_AIN2";
adc4.ADC.$suggestSolution                   = "ADC3";
adc4.ADC.AIN0.$suggestSolution              = "ADC3_AIN0";
adc4.ADC.AIN3.$suggestSolution              = "ADC3_AIN3";
adc5.ADC.$suggestSolution                   = "ADC0";
adc5.ADC.AIN2.$suggestSolution              = "ADC0_AIN2";
adc5.ADC.AIN3.$suggestSolution              = "ADC0_AIN3";
epwm2.EPWM.A.$suggestSolution               = "EPWM0_A";
epwm2.EPWM.B.$suggestSolution               = "EPWM0_B";
epwm3.EPWM.A.$suggestSolution               = "EPWM1_A";
epwm3.EPWM.B.$suggestSolution               = "EPWM1_B";
epwm4.EPWM.$suggestSolution                 = "EPWM2";
epwm4.EPWM.A.$suggestSolution               = "EPWM2_A";
epwm4.EPWM.B.$suggestSolution               = "EPWM2_B";
eqep1.EQEP.INDEX.$suggestSolution           = "MCAN2_RX";
gpio1.GPIO.$suggestSolution                 = "GPIO0";
gpio2.GPIO.$suggestSolution                 = "GPIO0";
gpio3.GPIO.$suggestSolution                 = "GPIO0";
gpio4.GPIO.$suggestSolution                 = "GPIO0";
gpio5.GPIO.$suggestSolution                 = "GPIO0";
gpio6.GPIO.$suggestSolution                 = "GPIO0";
gpio7.GPIO.$suggestSolution                 = "GPIO0";
gpio8.GPIO.$suggestSolution                 = "GPIO0";
gpio9.GPIO.$suggestSolution                 = "GPIO0";
gpio10.GPIO.$suggestSolution                = "GPIO0";
gpio11.GPIO.$suggestSolution                = "GPIO0";
gpio12.GPIO.$suggestSolution                = "GPIO0";
gpio13.GPIO.$suggestSolution                = "GPIO0";
mcspi1.SPI.CLK.$suggestSolution             = "SPI1_CLK";
mcspi1.SPI.D0.$suggestSolution              = "SPI1_D0";
mcspi1.SPI.D1.$suggestSolution              = "SPI1_D1";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "SPI1_CS0";
uart1.UART.$suggestSolution                 = "UART1";
uart1.UART.RXD.$suggestSolution             = "LIN1_RXD";
uart1.UART.TXD.$suggestSolution             = "LIN1_TXD";
